from collections import ChainMap 

a = {'x': 1, 'z': 3 } 
b = {'y': 2, 'z': 4 }
c = ChainMap(a,b)   
"""
>>> print(c['x'])
1
>>> print(c['z'])
3
>>> print(c['y'])
2
>>> print(c['z'])
3
>>> list(c.keys())
['y', 'z', 'x']
>>> len(c)
3
>>> list(c.values())
[2, 3, 1]
>>> c['z']=10
>>> c['w']=40
>>> del c['x']
>>> a
{'z': 10, 'w': 40}
"""
#В книге еще много примеров по применению ChainMap и ее отличительным свойствам 
#Таким как реагировать на изменения в первоначальных словарях при использовании ChainMap созданного объекта
